<a href="https://colab.research.google.com/github/AtheerMalki/Module03_python/blob/main/EDA_python_P9.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### In each cell complete the task using pandas

In [1]:
import pandas as pd
import numpy as np

Read in the titanic.csv file in the `~/data` directory as a pandas dataframe called **df**

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/daniel-dc-cd/data_science/master/module_3_Python/data/titanic.csv')

Display the head of the dataframe

In [3]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

What is the percentage of people who survived? (hint find the mean of the survival column)

In [18]:
survival_percentage = round(df.Survived.mean() * 100, 2)
print(survival_percentage, '%')

38.38 %

How many women and how many men survived?

In [19]:
df.groupby(['Survived','Sex']).count().Name

Survived  Sex
0         female     81
          male      468
1         female    233
          male      109
Name: Name, dtype: int64

What is the percentage of people that survied who paid a fare less than 10?

In [20]:
less_than_10_fare = df[ df['Fare'] < 10 ]
less_than_10_fare

     PassengerId  Survived  Pclass  ...    Fare Cabin  Embarked
0              1         0       3  ...  7.2500   NaN         S
2              3         1       3  ...  7.9250   NaN         S
4              5         0       3  ...  8.0500   NaN         S
5              6         0       3  ...  8.4583   NaN         Q
12            13         0       3  ...  8.0500   NaN         S
..           ...       ...     ...  ...     ...   ...       ...
877          878         0       3  ...  7.8958   NaN         S
878          879         0       3  ...  7.8958   NaN         S
881          882         0       3  ...  7.8958   NaN         S
884          885         0       3  ...  7.0500   NaN         S
890          891         0       3  ...  7.7500   NaN         Q

[336 rows x 12 columns]

In [21]:
survived_less_than_10_fare = less_than_10_fare[less_than_10_fare['Survived'] == 1]

# number of survivals
num_survivals = len(df[df['Survived'] == 1])
print('total survivals :', num_survivals)

# number of survivals who paid a fare less than 10 
num_10_fare_survivals = len(survived_less_than_10_fare)
print('survivals who paid a fare less than 10  :', num_10_fare_survivals)

# percentage
print('percentage: ', round((num_10_fare_survivals/num_survivals) * 100, 2), '%')

total survivals : 342
survivals who paid a fare less than 10  : 67
percentage:  19.59 %

What is the average age of those who didn't survive?

In [22]:
passed_away = df[df['Survived'] == 0]
round(passed_away.Age.mean(), 2)

30.63

What is the average age of those who did survive?

In [15]:
survived = df[df['Survived'] == 1]
round(survived.Age.mean(), 2)

28.34

What is the average age of those who did and didn't survive grouped by gender?

In [16]:
print('--- Survivals ---')
survived = df[df['Survived'] == 1]
print(round(survived.Age.groupby(survived.Sex).mean(), 2))

print('--- Non Survivals ---')
passed_away = df[df['Survived'] == 0]
print(round(passed_away.Age.groupby(passed_away.Sex).mean(), 2))

--- Survivals ---
Sex
female    28.85
male      27.28
Name: Age, dtype: float64
--- Non Survivals ---
Sex
female    25.05
male      31.62
Name: Age, dtype: float64

## Tidy GDP

Manipulate the GDP.csv file and make it tidy, the result should be a pandas dataframe with the following columns:
* Country Name
* Country Code
* Year
* GDP